using mySQLite;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace SQLiteProject
{
    public static class ScheduleInitializer
    {
        public static void CreateDefaultSchedules(SQLiteQueries db)
        {
            int id1 = 1;
            db.AddSchedule(id1, "1212", "Двухнедельное расписание", 2);

            db.AddLesson(id1, 1, 1, 1, "ТОК", "Соловьев В.П.", "27б", "13:00", "14:30");
            db.AddLesson(id1, 2, 1, 1, "История России", "Пирогов Д.В.", "ПСПШ", "17:00", "18:30");

            int id2 = 2;
            db.AddSchedule(id2, "1111", "Однонедельное расписание", 1);

            db.AddLesson(id2, 0, 2, 1, "ТОК", "Соловьев В.П.", "27б", "13:00", "14:30");
            db.AddLesson(id2, 0, 2, 2, "ТОК", "Соловьев В.П.", "27б", "14:40", "16:10");
            db.AddLesson(id2, 0, 2, 3, "РЛП", "Николаев К.Г.", "27б", "16:40", "18:10");
            db.AddLesson(id2, 0, 2, 4, "Компьютерное моделирование", "Соловьев А.В.", "27б", "18:20", "20:35");

            db.AddLesson(id2, 0, 3, 1, "История России", "Пирогов Д.В.", "ПСПШ", "17:00", "18:30");
            db.AddLesson(id2, 0, 3, 2, "История России", "Пирогов Д.В.", "ПСПШ", "18:35", "20:05");

            db.AddLesson(id2, 0, 5, 1, "Применение IT в гуманитарной сфере", "Глинников МВ", "27б", "10:30", "12:00");
            db.AddLesson(id2, 0, 5, 2, "Применение IT в гуманитарной сфере", "Глинников МВ", "27б", "12:10", "13:35");
            db.AddLesson(id2, 0, 5, 3, "Экстримальные задачи", "Пугачев О.В.", "Т1", "14:00", "15:30");
            db.AddLesson(id2, 0, 5, 4, "Экстримальные задачи", "Пугачев О.В.", "Т1", "15:40", "17:10");
            db.AddLesson(id2, 0, 5, 5, "История России", "Пирогов Д.В.", "Т6", "17:20", "18:50");

            db.AddLesson(id2, 0, 6, 1, "ТРПО", "Пуцко Н.Н.", "115", "9:00", "10:30");
            db.AddLesson(id2, 0, 6, 2, "ТРПО", "Пуцко Н.Н.", "115", "10:40", "12:10");
            db.AddLesson(id2, 0, 6, 3, "АИС", "Пуцко Н.Н.", "115", "12:30", "14:00");
            db.AddLesson(id2, 0, 6, 4, "АИС", "Пуцко Н.Н.", "115", "14:10", "14:55");
        }
    }
}